n5/src/Catalogs/Prices/Prices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Prices</name>
  <owners>Catalog.Companies</owners>
  <attributes>
    <name>BasePrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Detail</name>
    <type>
      <types>EnumRef.PriceDetails</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Percent</name>
    <type>
      <types>DefinedType.Percent</types>
    </type>
  </attributes>
  <attributes>
    <name>Pricing</name>
    <type>
      <types>EnumRef.Pricing</types>
    </type>
  </attributes>
  <attributes>
    <name>RoundMethod</name>
    <type>
      <types>EnumRef.Rounding</types>
    </type>
  </attributes>
  <attributes>
    <name>RoundToNextPart</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Enums/Pricing/Pricing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Pricing</name>
  <enumValues>
    <name>Base</name>
  </enumValues>
  <enumValues>
    <name>Percent</name>
  </enumValues>
  <enumValues>
    <name>ItemPercent</name>
  </enumValues>
  <enumValues>
    <name>Group</name>
  </enumValues>
  <enumValues>
    <name>Cost</name>
  </enumValues>
  <enumValues>
    <name>Purchase</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/PriceDetails/PriceDetails.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PriceDetails</name>
  <enumValues>
    <name>Item</name>
  </enumValues>
  <enumValues>
    <name>ItemAndWarehouse</name>
  </enumValues>
  <enumValues>
    <name>ItemAndOrganization</name>
  </enumValues>
  <enumValues>
    <name>ItemAndWarehouseAndOrganization</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/Prices/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
	endif; 
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|RoundMethod RoundToNextPart enable Object.Pricing <> Enum.Pricing.Base;
	|BasePrices Detail enable not inlist ( Object.Pricing,
	|	Enum.Pricing.Base, Enum.Pricing.Cost, Enum.Pricing.Purchase );
	|Percent enable Object.Pricing = Enum.Pricing.Percent;
	|Currency enable Object.Pricing <> Enum.Pricing.Cost;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif; 
	if ( Object.Owner.IsEmpty () ) then
		settings = Logins.Settings ( "Company" );
		Object.Owner = settings.Company;
	endif; 
	Object.Currency = Application.Currency ();
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure PricingOnChange ( Item )
	
	applyPricing ();
	
EndProcedure

&AtServer
Procedure applyPricing ()
	
	pricing = Object.Pricing;
	if ( pricing = Enums.Pricing.Base ) then
		Object.BasePrices = undefined;
		Object.RoundMethod = undefined;
		Object.RoundToNextPart = false;
	elsif ( pricing = Enums.Pricing.Cost ) then
		Object.BasePrices = undefined;
		Object.Currency = Application.Currency ();
	elsif ( pricing = Enums.Pricing.Purchase ) then
		Object.BasePrices = undefined;
	elsif ( pricing = Enums.Pricing.Percent ) then
		Object.Detail = Enums.PriceDetails.Item;
	endif;
	if ( pricing <> Enums.Pricing.Percent ) then
		Object.Percent = 0;
	endif;
	Appearance.Apply ( ThisObject, "Object.Pricing" );
	
EndProcedure
